{"_name_or_path": "ner_model", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "I-cost_relative", "1": "I-flight_stop", "2": "I-class_type", "3": "I-state_name", "4": "B-toloc.state_code", "5": "I-arrive_time.start_time", "6": "B-depart_date.date_relative", "7": "B-arrive_time.end_time", "8": "B-arrive_date.day_number", "9": "B-depart_time.start_time", "10": "B-airport_name", "11": "B-depart_date.month_name", "12": "B-arrive_date.day_name", "13": "B-aircraft_code", "14": "I-depart_time.end_time", "15": "B-stoploc.state_code", "16": "B-toloc.airport_code", "17": "I-city_name", "18": "B-economy", "19": "I-fare_basis_code", "20": "I-today_relative", "21": "B-return_time.period_mod", "22": "B-arrive_time.start_time", "23": "I-arrive_time.end_time", "24": "I-depart_date.today_relative", "25": "I-toloc.airport_name", "26": "O", "27": "B-arrive_date.month_name", "28": "B-arrive_time.period_of_day", "29": "B-return_date.date_relative", "30": "I-fromloc.city_name", "31": "I-transport_type", "32": "B-depart_time.end_time", "33": "I-return_date.today_relative", "34": "I-return_date.day_number", "35": "B-fare_basis_code", "36": "B-return_date.day_number", "37": "B-or", "38": "I-depart_time.time_relative", "39": "B-mod", "40": "I-depart_date.day_number", "41": "I-arrive_time.time", "42": "B-depart_time.time", "43": "B-toloc.country_name", "44": "B-time", "45": "I-arrive_time.period_of_day", "46": "B-depart_time.period_mod", "47": "B-arrive_date.today_relative", "48": "I-stoploc.city_name", "49": "B-stoploc.airport_code", "50": "B-fromloc.city_name", "51": "B-connect", "52": "I-toloc.state_name", "53": "B-day_number", "54": "B-meal_description", "55": "I-restriction_code", "56": "I-arrive_time.time_relative", "57": "B-flight_stop", "58": "B-fromloc.airport_name", "59": "B-arrive_time.time", "60": "B-depart_date.year", "61": "I-round_trip", "62": "B-return_date.month_name", "63": "I-airline_name", "64": "B-return_date.today_relative", "65": "B-fromloc.airport_code", "66": "I-mod", "67": "B-month_name", "68": "I-fare_amount", "69": "B-fromloc.state_name", "70": "B-stoploc.airport_name", "71": "I-depart_time.start_time", "72": "I-economy", "73": "I-airport_name", "74": "B-arrive_time.time_relative", "75": "B-fare_amount", "76": "B-flight", "77": "I-time", "78": "I-meal_code", "79": "B-class_type", "80": "B-airline_name", "81": "B-state_name", "82": "B-stoploc.city_name", "83": "I-arrive_date.day_number", "84": "B-flight_number", "85": "I-fromloc.airport_name", "86": "B-transport_type", "87": "B-depart_date.today_relative", "88": "I-flight_number", "89": "I-flight_time", "90": "B-flight_time", "91": "I-return_date.date_relative", "92": "I-depart_time.time", "93": "B-depart_time.time_relative", "94": "B-airline_code", "95": "B-city_name", "96": "B-return_date.day_name", "97": "B-booking_class", "98": "B-cost_relative", "99": "B-depart_date.day_name", "100": "B-arrive_date.date_relative", "101": "B-arrive_time.period_mod", "102": "B-compartment", "103": "B-fromloc.state_code", "104": "B-flight_days", "105": "B-state_code", "106": "B-flight_mod", "107": "B-time_relative", "108": "I-depart_date.day_name", "109": "B-day_name", "110": "I-toloc.city_name", "111": "B-meal", "112": "B-restriction_code", "113": "B-days_code", "114": "B-airport_code", "115": "B-today_relative", "116": "B-depart_time.period_of_day", "117": "B-return_time.period_of_day", "118": "B-depart_date.day_number", "119": "I-fromloc.state_name", "120": "B-toloc.state_name", "121": "B-toloc.city_name", "122": "B-round_trip", "123": "B-period_of_day", "124": "B-toloc.airport_name", "125": "B-meal_code", "126": "I-depart_time.period_of_day", "127": "I-flight_mod", "128": "I-meal_description"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"I-cost_relative": "0", "I-flight_stop": "1", "I-class_type": "2", "I-state_name": "3", "B-toloc.state_code": "4", "I-arrive_time.start_time": "5", "B-depart_date.date_relative": "6", "B-arrive_time.end_time": "7", "B-arrive_date.day_number": "8", "B-depart_time.start_time": "9", "B-airport_name": "10", "B-depart_date.month_name": "11", "B-arrive_date.day_name": "12", "B-aircraft_code": "13", "I-depart_time.end_time": "14", "B-stoploc.state_code": "15", "B-toloc.airport_code": "16", "I-city_name": "17", "B-economy": "18", "I-fare_basis_code": "19", "I-today_relative": "20", "B-return_time.period_mod": "21", "B-arrive_time.start_time": "22", "I-arrive_time.end_time": "23", "I-depart_date.today_relative": "24", "I-toloc.airport_name": "25", "O": "26", "B-arrive_date.month_name": "27", "B-arrive_time.period_of_day": "28", "B-return_date.date_relative": "29", "I-fromloc.city_name": "30", "I-transport_type": "31", "B-depart_time.end_time": "32", "I-return_date.today_relative": "33", "I-return_date.day_number": "34", "B-fare_basis_code": "35", "B-return_date.day_number": "36", "B-or": "37", "I-depart_time.time_relative": "38", "B-mod": "39", "I-depart_date.day_number": "40", "I-arrive_time.time": "41", "B-depart_time.time": "42", "B-toloc.country_name": "43", "B-time": "44", "I-arrive_time.period_of_day": "45", "B-depart_time.period_mod": "46", "B-arrive_date.today_relative": "47", "I-stoploc.city_name": "48", "B-stoploc.airport_code": "49", "B-fromloc.city_name": "50", "B-connect": "51", "I-toloc.state_name": "52", "B-day_number": "53", "B-meal_description": "54", "I-restriction_code": "55", "I-arrive_time.time_relative": "56", "B-flight_stop": "57", "B-fromloc.airport_name": "58", "B-arrive_time.time": "59", "B-depart_date.year": "60", "I-round_trip": "61", "B-return_date.month_name": "62", "I-airline_name": "63", "B-return_date.today_relative": "64", "B-fromloc.airport_code": "65", "I-mod": "66", "B-month_name": "67", "I-fare_amount": "68", "B-fromloc.state_name": "69", "B-stoploc.airport_name": "70", "I-depart_time.start_time": "71", "I-economy": "72", "I-airport_name": "73", "B-arrive_time.time_relative": "74", "B-fare_amount": "75", "B-flight": "76", "I-time": "77", "I-meal_code": "78", "B-class_type": "79", "B-airline_name": "80", "B-state_name": "81", "B-stoploc.city_name": "82", "I-arrive_date.day_number": "83", "B-flight_number": "84", "I-fromloc.airport_name": "85", "B-transport_type": "86", "B-depart_date.today_relative": "87", "I-flight_number": "88", "I-flight_time": "89", "B-flight_time": "90", "I-return_date.date_relative": "91", "I-depart_time.time": "92", "B-depart_time.time_relative": "93", "B-airline_code": "94", "B-city_name": "95", "B-return_date.day_name": "96", "B-booking_class": "97", "B-cost_relative": "98", "B-depart_date.day_name": "99", "B-arrive_date.date_relative": "100", "B-arrive_time.period_mod": "101", "B-compartment": "102", "B-fromloc.state_code": "103", "B-flight_days": "104", "B-state_code": "105", "B-flight_mod": "106", "B-time_relative": "107", "I-depart_date.day_name": "108", "B-day_name": "109", "I-toloc.city_name": "110", "B-meal": "111", "B-restriction_code": "112", "B-days_code": "113", "B-airport_code": "114", "B-today_relative": "115", "B-depart_time.period_of_day": "116", "B-return_time.period_of_day": "117", "B-depart_date.day_number": "118", "I-fromloc.state_name": "119", "B-toloc.state_name": "120", "B-toloc.city_name": "121", "B-round_trip": "122", "B-period_of_day": "123", "B-toloc.airport_name": "124", "B-meal_code": "125", "I-depart_time.period_of_day": "126", "I-flight_mod": "127", "I-meal_description": "128"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.35.2", "type_vocab_size": 2, "use_cache": true, "vocab_size": 30524}