{
    "_name_or_path": "bert-base-uncased",
    "architectures": [
        "BertForTokenClassification"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
        "0": "B-state_name",
        "1": "B-city_name",
        "2": "B-return_date.day_number",
        "3": "I-transport_type",
        "4": "B-return_date.month_name",
        "5": "B-arrive_date.day_number",
        "6": "B-arrive_time.time_relative",
        "7": "I-airport_name",
        "8": "B-or",
        "9": "I-toloc.city_name",
        "10": "I-fromloc.airport_name",
        "11": "I-stoploc.city_name",
        "12": "B-depart_date.day_number",
        "13": "B-toloc.state_code",
        "14": "I-flight_number",
        "15": "B-depart_time.time_relative",
        "16": "I-toloc.airport_name",
        "17": "I-fromloc.city_name",
        "18": "I-economy",
        "19": "B-arrive_date.date_relative",
        "20": "B-time",
        "21": "I-depart_date.day_number",
        "22": "I-cost_relative",
        "23": "B-depart_time.period_mod",
        "24": "I-mod",
        "25": "B-stoploc.airport_code",
        "26": "I-meal_description",
        "27": "B-flight",
        "28": "B-airline_code",
        "29": "B-fromloc.airport_code",
        "30": "B-connect",
        "31": "I-flight_time",
        "32": "I-fare_amount",
        "33": "I-fromloc.state_name",
        "34": "B-compartment",
        "35": "B-return_time.period_of_day",
        "36": "B-depart_date.month_name",
        "37": "I-return_date.date_relative",
        "38": "B-return_time.period_mod",
        "39": "B-cost_relative",
        "40": "B-economy",
        "41": "I-round_trip",
        "42": "I-arrive_date.day_number",
        "43": "B-airline_name",
        "44": "B-arrive_time.period_of_day",
        "45": "B-flight_days",
        "46": "I-today_relative",
        "47": "B-booking_class",
        "48": "B-meal",
        "49": "B-return_date.today_relative",
        "50": "B-restriction_code",
        "51": "B-airport_code",
        "52": "B-aircraft_code",
        "53": "B-state_code",
        "54": "B-toloc.country_name",
        "55": "B-depart_time.time",
        "56": "B-flight_mod",
        "57": "B-fromloc.airport_name",
        "58": "B-depart_time.start_time",
        "59": "I-depart_date.day_name",
        "60": "B-month_name",
        "61": "B-depart_date.date_relative",
        "62": "B-return_date.date_relative",
        "63": "B-toloc.city_name",
        "64": "I-restriction_code",
        "65": "B-arrive_time.start_time",
        "66": "B-toloc.airport_code",
        "67": "I-arrive_time.period_of_day",
        "68": "I-flight_stop",
        "69": "B-return_date.day_name",
        "70": "B-meal_description",
        "71": "B-depart_date.year",
        "72": "I-depart_time.end_time",
        "73": "B-toloc.state_name",
        "74": "I-airline_name",
        "75": "B-airport_name",
        "76": "B-mod",
        "77": "I-state_name",
        "78": "I-arrive_time.time_relative",
        "79": "B-depart_time.period_of_day",
        "80": "B-fromloc.city_name",
        "81": "B-fare_amount",
        "82": "B-period_of_day",
        "83": "I-depart_time.period_of_day",
        "84": "I-depart_time.time",
        "85": "I-depart_time.time_relative",
        "86": "I-return_date.day_number",
        "87": "B-fromloc.state_name",
        "88": "B-arrive_time.period_mod",
        "89": "I-depart_time.start_time",
        "90": "I-toloc.state_name",
        "91": "I-arrive_time.time",
        "92": "I-city_name",
        "93": "B-time_relative",
        "94": "I-depart_date.today_relative",
        "95": "B-flight_stop",
        "96": "B-day_name",
        "97": "B-meal_code",
        "98": "I-time",
        "99": "B-transport_type",
        "100": "B-arrive_date.today_relative",
        "101": "B-day_number",
        "102": "B-depart_date.today_relative",
        "103": "B-depart_time.end_time",
        "104": "I-meal_code",
        "105": "B-flight_number",
        "106": "B-arrive_time.end_time",
        "107": "B-stoploc.city_name",
        "108": "I-arrive_time.start_time",
        "109": "B-fare_basis_code",
        "110": "B-stoploc.airport_name",
        "111": "B-arrive_date.day_name",
        "112": "I-fare_basis_code",
        "113": "I-return_date.today_relative",
        "114": "I-flight_mod",
        "115": "B-class_type",
        "116": "B-days_code",
        "117": "I-class_type",
        "118": "B-fromloc.state_code",
        "119": "B-toloc.airport_name",
        "120": "B-round_trip",
        "121": "B-arrive_date.month_name",
        "122": "B-stoploc.state_code",
        "123": "B-flight_time",
        "124": "I-arrive_time.end_time",
        "125": "B-arrive_time.time",
        "126": "B-today_relative",
        "127": "B-depart_date.day_name",
        "128": "O"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
        "B-state_name": "0",
        "B-city_name": "1",
        "B-return_date.day_number": "2",
        "I-transport_type": "3",
        "B-return_date.month_name": "4",
        "B-arrive_date.day_number": "5",
        "B-arrive_time.time_relative": "6",
        "I-airport_name": "7",
        "B-or": "8",
        "I-toloc.city_name": "9",
        "I-fromloc.airport_name": "10",
        "I-stoploc.city_name": "11",
        "B-depart_date.day_number": "12",
        "B-toloc.state_code": "13",
        "I-flight_number": "14",
        "B-depart_time.time_relative": "15",
        "I-toloc.airport_name": "16",
        "I-fromloc.city_name": "17",
        "I-economy": "18",
        "B-arrive_date.date_relative": "19",
        "B-time": "20",
        "I-depart_date.day_number": "21",
        "I-cost_relative": "22",
        "B-depart_time.period_mod": "23",
        "I-mod": "24",
        "B-stoploc.airport_code": "25",
        "I-meal_description": "26",
        "B-flight": "27",
        "B-airline_code": "28",
        "B-fromloc.airport_code": "29",
        "B-connect": "30",
        "I-flight_time": "31",
        "I-fare_amount": "32",
        "I-fromloc.state_name": "33",
        "B-compartment": "34",
        "B-return_time.period_of_day": "35",
        "B-depart_date.month_name": "36",
        "I-return_date.date_relative": "37",
        "B-return_time.period_mod": "38",
        "B-cost_relative": "39",
        "B-economy": "40",
        "I-round_trip": "41",
        "I-arrive_date.day_number": "42",
        "B-airline_name": "43",
        "B-arrive_time.period_of_day": "44",
        "B-flight_days": "45",
        "I-today_relative": "46",
        "B-booking_class": "47",
        "B-meal": "48",
        "B-return_date.today_relative": "49",
        "B-restriction_code": "50",
        "B-airport_code": "51",
        "B-aircraft_code": "52",
        "B-state_code": "53",
        "B-toloc.country_name": "54",
        "B-depart_time.time": "55",
        "B-flight_mod": "56",
        "B-fromloc.airport_name": "57",
        "B-depart_time.start_time": "58",
        "I-depart_date.day_name": "59",
        "B-month_name": "60",
        "B-depart_date.date_relative": "61",
        "B-return_date.date_relative": "62",
        "B-toloc.city_name": "63",
        "I-restriction_code": "64",
        "B-arrive_time.start_time": "65",
        "B-toloc.airport_code": "66",
        "I-arrive_time.period_of_day": "67",
        "I-flight_stop": "68",
        "B-return_date.day_name": "69",
        "B-meal_description": "70",
        "B-depart_date.year": "71",
        "I-depart_time.end_time": "72",
        "B-toloc.state_name": "73",
        "I-airline_name": "74",
        "B-airport_name": "75",
        "B-mod": "76",
        "I-state_name": "77",
        "I-arrive_time.time_relative": "78",
        "B-depart_time.period_of_day": "79",
        "B-fromloc.city_name": "80",
        "B-fare_amount": "81",
        "B-period_of_day": "82",
        "I-depart_time.period_of_day": "83",
        "I-depart_time.time": "84",
        "I-depart_time.time_relative": "85",
        "I-return_date.day_number": "86",
        "B-fromloc.state_name": "87",
        "B-arrive_time.period_mod": "88",
        "I-depart_time.start_time": "89",
        "I-toloc.state_name": "90",
        "I-arrive_time.time": "91",
        "I-city_name": "92",
        "B-time_relative": "93",
        "I-depart_date.today_relative": "94",
        "B-flight_stop": "95",
        "B-day_name": "96",
        "B-meal_code": "97",
        "I-time": "98",
        "B-transport_type": "99",
        "B-arrive_date.today_relative": "100",
        "B-day_number": "101",
        "B-depart_date.today_relative": "102",
        "B-depart_time.end_time": "103",
        "I-meal_code": "104",
        "B-flight_number": "105",
        "B-arrive_time.end_time": "106",
        "B-stoploc.city_name": "107",
        "I-arrive_time.start_time": "108",
        "B-fare_basis_code": "109",
        "B-stoploc.airport_name": "110",
        "B-arrive_date.day_name": "111",
        "I-fare_basis_code": "112",
        "I-return_date.today_relative": "113",
        "I-flight_mod": "114",
        "B-class_type": "115",
        "B-days_code": "116",
        "I-class_type": "117",
        "B-fromloc.state_code": "118",
        "B-toloc.airport_name": "119",
        "B-round_trip": "120",
        "B-arrive_date.month_name": "121",
        "B-stoploc.state_code": "122",
        "B-flight_time": "123",
        "I-arrive_time.end_time": "124",
        "B-arrive_time.time": "125",
        "B-today_relative": "126",
        "B-depart_date.day_name": "127",
        "O": "128"
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "transformers_version": "4.35.2",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 30524
}